// ❓ УСЛОВИЕ:

// Первый входной массив содержит правильные ответы на экзамен, например: ["a", "a", "b", "d"].
// Второй массив содержит ответы, предоставленные студентом.
// Оба массива не пустые и имеют одинаковую длину.
// Необходимо вычислить и вернуть итоговый балл: +4 балла за каждый правильный ответ, -1 балл за каждый неправильный ответ и 0 баллов за пропущенный ответ (обозначается пустой строкой; в языке C для этого используется символ пробела).
// Если итоговый балл меньше 0, следует вернуть 0. Например:

//   Правильные ответы   |    Ответы студента    |  Результат
//  ---------------------|-----------------------|-----------
//  ["a", "a", "b", "b"]   ["a", "c", "b", "d"]  →     6
//  ["a", "a", "c", "b"]   ["a", "a", "b", "" ]  →     7
//  ["a", "a", "b", "c"]   ["a", "a", "b", "c"]  →     16
//  ["b", "c", "b", "a"]   ["" , "a", "a", "c"]  →     0

// ✅ РЕШЕНИЕ1:

// function checkExam(array1, array2) {
//   let sum = 0;
//   for (let i = 0; i < array1.length; i++) {
//     if (array1[i] === undefined || array2[i] === undefined || array1[i] === '' || array2[i] === '') {
//       sum += 0
//     } else if (array1[i] === array2[i]) {
//       sum += 4
//     } else if (array1[i] !== array2[i]) {
//       sum -= 1
//     }
//   }
//   return sum < 0 ? 0 : sum;
// }

// ✅ РЕШЕНИЕ2:

function checkExam(array1, array2) {
  let sum = 0;
  for (let i = 0; i < array1.length; i++) {
    array1[i] === undefined || array2[i] === undefined || array1[i] === '' || array2[i] === '' ? sum += 0 : array1[i] === array2[i] ? sum += 4 : sum -= 1
  }
  return sum < 0 ? 0 : sum;
}