// ❓ УСЛОВИЕ:

//  Ваша задача — вернуть выходную строку, которая преобразует входную строку s, заменяя каждый символ в s числом, представляющим количество вхождений этого символа в s, и разделяя каждое число символом (или символами) sep.

// Пример:
// "hello world", "-" --> "1-1-3-3-2-1-1-2-1-3-1"
// "19999999"   , ":" --> "1:7:7:7:7:7:7:7"
// "^^^**$"     , "x" --> "3x3x3x2x2x1"

// ✅ РЕШЕНИЕ:

function freqSeq(str, sep) {
  const charCount = {};
  for (const char of str) {
    charCount[char] = (charCount[char] || 0) + 1;
  }
  return Array.from(str)
    .map(char => charCount[char])
    .join(sep);
}
