// ❓ УСЛОВИЕ:

//  Целое число называется «злым» (Evil), если в его двоичном представлении содержится четное количество единиц.
//  Первые несколько «злых» чисел: 3, 5, 6, 9, 10, 12, 15, 17, 18, 20.

//  Целое число называется «гнусным» (Odious), если в его двоичном представлении содержится нечетное количество единиц.
//  Первые несколько «гнусных» чисел: 1, 2, 4, 7, 8, 11, 13, 14, 16, 19.
//  Вам нужно написать функцию, которая определяет, является ли число «злым» или «гнусным»: функция должна возвращать строку "It's Evil!", если число «злое», и строку "It's Odious!", если число «гнусное».
//  Удачи! :)

// ✅ РЕШЕНИЕ:

function evil(n) {
  const countOnes = n.toString(2).split('1').length - 1;
  if (countOnes % 2 === 0) {
    return "It's Evil!";
  } else {
    return "It's Odious!";
  }
}