// ❓ УСЛОВИЕ:

// Для прыгуна с шестом крайне важно начинать разбег с оптимальной стартовой отметки. На выбор этой точки влияет множество факторов, и она требует точной настройки в процессе тренировок. Однако существует ориентир, помогающий начинающему прыгуну выбрать приблизительно верную позицию для так называемого «разбега в три шага» в зависимости от его роста. Изначально меня учили определять это расстояние в футах и дюймах, но, учитывая международный характер платформы Codewars, я создал эту задачу (ката) с использованием метрической системы.
// Для начала вам даны два ориентира: (1) прыгун ростом 1,52 метра должен начинать разбег с отметки 9,45 метра; (2) прыгун ростом 1,83 метра должен начинать разбег с отметки 10,67 метра.
// На вход будет подаваться рост прыгуна в метрах (значение всегда будет находиться в диапазоне от 1,22 до 2,13 метра).
// Ваша задача — вернуть оптимальную стартовую отметку в метрах с точностью до 0,01.
// Подсказка: опираясь на два приведенных выше ориентира, следует учесть изменение стартовой отметки в зависимости от изменения роста.
// Здесь прослеживается линейная зависимость (если этот термин вам не знаком, поищите в интернете информацию о «линейном уравнении»).
// Однако также присутствует постоянное смещение. Если вы сможете определить описанную выше скорость изменения, то сумеете вычислить и это постоянное смещение.

// ✅ РЕШЕНИЕ1:
// const a = 1.52
// const b = 9.45
// const a2 = 1.83
// const b2 = 10.67
// const k = (b2 - b) / (a2 - a)  //  3,935
// const bOffset = b - (a * k)
//
// function startingMark(bodyHeight){
//   const result = (k * bodyHeight) + bOffset
//   return Number(result.toFixed(2))
// }

// ✅ РЕШЕНИЕ2:
const k = 3.935
const offset = 3.468

function startingMark(bodyHeight){
  const result = (k * bodyHeight) + offset
  return Number(result.toFixed(2))
}

