// ❓ УСЛОВИЕ:

//  Вы пишете код для управления светофорами в своем городе. Вам нужна функция, которая будет обрабатывать смену сигналов: с зеленого на желтый, с желтого на красный, а затем снова на зеленый.
//  Допишите функцию, которая принимает в качестве аргумента строку, обозначающую текущий сигнал светофора, и возвращает строку, обозначающую сигнал, на который он должен смениться.
//  Например, если на входе «зеленый», на выходе должен быть «желтый».

// ✅ РЕШЕНИЕ:

function updateLight(current) {
  return current === "green" ? "yellow" : current === "yellow" ? "red" : "green";
}