// ❓ УСЛОВИЕ:

// Напишите метод, который принимает массив целых чисел и обрабатывает каждый элемент этого массива.
// Метод должен возвращать новый массив, сформированный по следующему правилу: если число имеет целый квадратный корень, берется этот корень; в противном случае число возводится в квадрат.
// Пример: [4, 3, 9, 7, 2, 1] -> [2, 9, 3, 49, 4, 1].
// Примечание: входной массив всегда содержит только положительные числа и никогда не бывает пустым или равным null.

// ✅ РЕШЕНИЕ:

function squareOrSquareRoot(array) {
  const result = [];
  for (let i = 0; i < array.length; i++) {
    if (Math.sqrt(array[i]) % 1 === 0) {
      result.push(Math.sqrt(array[i]))
    } else {
      result.push(array[i] ** 2)
    }
  }
  return result;
}