// ❓ УСЛОВИЕ:

// Если выписать все натуральные числа меньше 10, кратные 3 или 5, мы получим 3, 5, 6 и 9. Сумма этих чисел равна 23.
// Завершите решение так, чтобы оно возвращало сумму всех чисел, кратных 3 или 5 и меньших заданного числа.
// Кроме того, если число отрицательное, функция должна возвращать 0.
// Примечание: если число кратно и 3, и 5, учитывайте его только один раз

// ✅ РЕШЕНИЕ1:

// function solution(number) {
//   if (number < 0) return 0;
//   let result = []
//   for (let i = 3; i < number; i++) {
//     if (i % 3 === 0 || i % 5 === 0) {
//       result.push(i)
//     }
//   }
//   return result.reduce((acc, num) => acc + num, 0);
// }

// ✅ РЕШЕНИЕ2:

function solution(number) {
  if (number < 0) return 0;
  let sum = 0
  for (let i = 3; i < number; i++) {
    if (i % 3 === 0 || i % 5 === 0) {
      sum += i
    }
  }
  return sum
}
