// ❓ УСЛОВИЕ:

//  Напишите функцию `persistence`, которая принимает положительный параметр `num` и возвращает его мультипликативное значение `persistence`, то есть количество раз, которое необходимо умножить цифры в `num`, чтобы получить однозначное число.
//
//  Например (Ввод --> Вывод):
//  39 --> 3 (Поскольку 3*9 = 27, 2*7 = 14, 1*4 = 4    поскольку у числа 4 только одна цифра, то здесь 3 умножения)
//  999 --> 4 (Поскольку  9*9*9 = 729, 7*2*9 = 126, 1*2*6 = 12, и последнее 1*2 = 2, здесь 4 умножения)
//  4 --> 0 (Поскольку 4 уже является однозначным числом, умножение не требуется)

// ✅ РЕШЕНИЕ:



function persistence(num) {
  let count = 0;
  while (num >= 10) {
    const arr = Array.from(String(num), Number);
    num = arr.reduce((acc, digit) => acc * digit);
    count++;
  }
  return count;
}